docs/math/pde/methods.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-04-11 Sun 12:09 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Methods of Solving PDEs</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Nelson">
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Methods of Solving PDEs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#h-f9fcc069-0b1d-4a4e-9438-80c476b81a00">1. Group Symmetry Methods</a>
<ul>
<li><a href="#h-07109b40-d0f9-43c8-af78-5b0e1aed7ba9">1.1. Classical Symmetries</a></li>
<li><a href="#h-10abac87-d348-4d33-afd2-f2ca13f2ead4">1.2. Nonclassical Symmetry Reduction</a></li>
<li><a href="#h-bf2360c2-34c8-4826-a3b8-e61811ed61c5">1.3. Approximate Symmetries</a></li>
</ul>
</li>
<li><a href="#h-82fab9ef-80d3-446d-b9c2-0592f9b69129">2. Differential Constraints</a></li>
<li><a href="#h-82511732-d06f-4171-a4aa-63f6eded2106">3. Clarkson-Kruskal method</a></li>
<li><a href="#h-428184a8-896b-4f4a-b3ff-3e545baa634b">4. Functional Separation of Variables</a></li>
</ul>
</div>
</div>
<p>
A recent review (<a href="https://arxiv.org/abs/2102.04815">arXiv:2102.04815</a>) noted:
</p>

<blockquote>
<p>
There are several basic methods for finding exact solutions and
constructing reductions of nonlinear partial differential equations:
the method of group analysis of differential equations (the method of
searching for classical symmetries) [1–6], methods for finding for
non-classical symmetries [7–10], the direct Clarkson–Kruskal method
[11–14], methods for generalized separation of variables [13–15], methods
for functional separation of variables [14,16–18], the method of
differential constraints [13,14,19], the method of truncated Painleve
expansions [13,20,21], and use of conservation laws to obtain exact
solutions [22–24].
</p>
</blockquote>

<div id="outline-container-h-f9fcc069-0b1d-4a4e-9438-80c476b81a00" class="outline-2">
<h2 id="h-f9fcc069-0b1d-4a4e-9438-80c476b81a00"><span class="section-number-2">1</span> Group Symmetry Methods</h2>
<div class="outline-text-2" id="text-h-f9fcc069-0b1d-4a4e-9438-80c476b81a00">
</div>

<div id="outline-container-h-07109b40-d0f9-43c8-af78-5b0e1aed7ba9" class="outline-3">
<h3 id="h-07109b40-d0f9-43c8-af78-5b0e1aed7ba9"><span class="section-number-3">1.1</span> Classical Symmetries</h3>
<div class="outline-text-3" id="text-h-07109b40-d0f9-43c8-af78-5b0e1aed7ba9">
<ul class="org-ul">
<li>Ovsiannikov, L.V. <br>
<cite class="book-title">Group Analysis of Differential Equations</cite>. <br>
Academic Press, 1982.</li>
<li>GW Bluman, JW Cole, <br>
<cite class="book-title">Similarity Methods for Differential Equations</cite>. <br>
Springer, 1974.</li>
<li>PJ Olver, <br>
<cite class="book-title">Applications of Lie Groups to Differential Equations</cite>. <br>
2nd ed., Springer, 2000</li>
<li>VK Andreev, OV Kaptsov, VV Pukhnachov, AA Rodionov, <br>
<cite class="book-title">Applications of Group-Theoretical Methods in Hydrodynamics</cite>. <br>
Kluwer, 1998.</li>
</ul>
</div>
</div>

<div id="outline-container-h-10abac87-d348-4d33-afd2-f2ca13f2ead4" class="outline-3">
<h3 id="h-10abac87-d348-4d33-afd2-f2ca13f2ead4"><span class="section-number-3">1.2</span> Nonclassical Symmetry Reduction</h3>
<div class="outline-text-3" id="text-h-10abac87-d348-4d33-afd2-f2ca13f2ead4">
<ul class="org-ul">
<li>Peter A. Clarkson, Elizabeth L. Mansfield, <br>
"Algorithms for the Nonclassical Method of Symmetry Reductions". <br>
<a href="https://arxiv.org/abs/solv-int/9401002">arXiv:solv-int/9401002</a>, 27 pages</li>
<li>Peter J Olver and Evgenii M Vorob'ev, <br>
"Nonclassical and Conditional Symmetries". <br>
In: <i>CRC Handbook of Lie Group Analysis of Differential Equations</i>, vol.
3, N.H. Ibragimov, ed., CRC Press, Boca Raton, Fl., 1996, pp.291&#x2013;328.
<a href="http://www-users.math.umn.edu/~olver/s_/v.pdf">PDF</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-h-bf2360c2-34c8-4826-a3b8-e61811ed61c5" class="outline-3">
<h3 id="h-bf2360c2-34c8-4826-a3b8-e61811ed61c5"><span class="section-number-3">1.3</span> Approximate Symmetries</h3>
<div class="outline-text-3" id="text-h-bf2360c2-34c8-4826-a3b8-e61811ed61c5">
<p>
Also note there is another technique using "approximate symmetries",
where the differential equation <i>we</i> are interested in solving may be
viewed as a <i>perturbation</i> of a simpler differential equation. We may
find the symmetries of the simpler equation, then use it as the basis
for a <i>perturbed</i> symmetry group (approximate symmetry group) of our
original differential equation.
</p>

<ul class="org-ul">
<li>Baikov, Gazizov, and Ibragimov, <br>
"Approximate symmetries". <br>
<i>Math. USSR Sbomik</i> <b>46</b> (1989) pp.427&#x2013;441.
<ul class="org-ul">
<li>First publication inventing the technique</li>
</ul></li>
<li>V. A. Baikov, R. K. Gazizov, N. Kh. Ibragimov, <br>
"Approximate symmetries". <br>
<i>Mat. Sb.</i> (N.S.), <b>136(178)</b>:4(8) (1988), 435–450;
<i>Math. USSR-Sb.</i>, <b>64</b>:2 (1989), 427–441.
<a href="http://www.mathnet.ru/php/archive.phtml?wshow=paper&amp;jrnid=sm&amp;paperid=1752&amp;option_lang=eng">Eprint</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-h-82fab9ef-80d3-446d-b9c2-0592f9b69129" class="outline-2">
<h2 id="h-82fab9ef-80d3-446d-b9c2-0592f9b69129"><span class="section-number-2">2</span> Differential Constraints</h2>
<div class="outline-text-2" id="text-h-82fab9ef-80d3-446d-b9c2-0592f9b69129">
<p>
CRC Handbook of Nonlinear PDEs describe this method as: "The main idea
of the method is that exact solutions to a complex (nonintegrable)
equation are sought by jointly analyzing this equation and an auxiliary
simpler (integrable) equation, called a <i>differential constraint</i>."
</p>

<ul class="org-ul">
<li>Peter Olver, <br>
<a href="http://www-users.math.umn.edu/~olver/s_/dc.pdf">Direct Reduction and Differential Constraints</a>. <br>
<i>Proc. Roy. Soc. London</i> <b>A 444</b> (1994), 509&#x2013;523.</li>
</ul>
</div>
</div>

<div id="outline-container-h-82511732-d06f-4171-a4aa-63f6eded2106" class="outline-2">
<h2 id="h-82511732-d06f-4171-a4aa-63f6eded2106"><span class="section-number-2">3</span> Clarkson-Kruskal method</h2>
<div class="outline-text-2" id="text-h-82511732-d06f-4171-a4aa-63f6eded2106">
<ul class="org-ul">
<li>P A Clarkson and M D Kruskal, <br>
"New similarity solutions of the Boussinesq equation". <br>
<i>Journal of Mathematical Physics</i> <b>30</b> (1989) pp 2201-2213.
<ul class="org-ul">
<li>First paper introducing the technique.</li>
</ul></li>
<li>SHEN Shou-Feng, <br>
"Clarkson–Kruskal Direct Similarity Approach for
Differential-Difference Equations". <br>
<i>Commun. Theor. Phys.</i> (Beijing, China) <b>44</b> (2005) pp. 964–966</li>
<li>AD Polyanin, <br>
"Comparison of the effectiveness of different methods for constructing
exact solutions to nonlinear PDEs". <br>
<i>Mathematics</i> <b>7</b>, no. 5 (2019)
<a href="https://doi.org/10.3390/math7050386">doi:10.3390/math7050386</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-428184a8-896b-4f4a-b3ff-3e545baa634b" class="outline-2">
<h2 id="h-428184a8-896b-4f4a-b3ff-3e545baa634b"><span class="section-number-2">4</span> Functional Separation of Variables</h2>
<div class="outline-text-2" id="text-h-428184a8-896b-4f4a-b3ff-3e545baa634b">
<p>
The basic idea is to solve the problem
</p>

\begin{equation}
F(x, u_{x}, u_{t}, u_{xx}, u_{xt}, u_{tt}, \dots) = 0
\end{equation}

<p>
The separation of variables usually takes the form \(u(x,t) = X(x)T(t)\),
but the <i>functional separation of variables</i> uses the implicit form
</p>

\begin{equation}
\int h(u)\,\D u = \xi(x)\omega(t) + \eta(x).
\end{equation}

<p>
Where in Heaven's name does this come from? And what on Earth is \(h(u)\),
\(\xi(x)\), \(\omega(t)\), and \(\eta(x)\)?
</p>

<p>
Well, this is a generalization of the nonlinear heat equation
</p>

\begin{equation}
u_{t} = \partial_{x}[f(u)u_{x}]
\end{equation}

<p>
where \(f(u)\) is an arbitrary function. This admits a traveling-wave
solution \(u=u(z)\) for \(z=\lambda t + \kappa x\), which can be represented
in the implicit form
</p>

\begin{equation}
\kappa^{2}\int\frac{f(u)}{\lambda u + C_{1}}\D u = \lambda t + \kappa x +
C_{2}
\end{equation}

<p>
The generalization is carried out as follows:
</p>

<p>
\[ \kappa^{2}\frac{f(u)}{\lambda u + C_{1}} \to h(u) \]
</p>

<p>
\[ \lambda\to \xi(x) \]
</p>

<p>
\[ t \to \omega(t) \]
</p>

<p>
\[ \kappa x + C_{2}\to \eta(x).\]
</p>

<ul class="org-ul">
<li>Andrei D. Polyanin, <br>
"Construction of exact solutions in implicit form for PDEs: New
functional separable solutions of non-linear reaction-diffusion
equations with variable coefficients". <br>
May 2019 <i>International Journal of Non-Linear Mechanics</i> <b>111</b>:95-105
DOI: <a href="http://dx.doi.org/10.1016/j.ijnonlinmec.2019.02.005">10.1016/j.ijnonlinmec.2019.02.005</a>,
<a href="http://eqworld.ipmnet.ru/Arts_Polyanin/NLM_2019_Polyanin.pdf">Eprint</a></li>
<li>Andrei D. Polyanin, <br>
"Functional separation of variables in nonlinear PDEs: General
approach, new solutions of diffusion-type equations". <br>
<a href="https://arxiv.org/abs/2001.01645">arXiv:2001.01645</a>, 56 pages</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2021-04-11 Sun 11:59.</p>
</div>
</body>
</html>